import pandas as pd
import pulp

#從SQL取得係數資料表
# 導入pymysql模塊
import pymssql
# 連接database
#Connecting using Windows Authentication
#conn = pymssql.connect(
#    host=r'dbhostname\myinstance',
#    user=r'companydomain\username',
#    password=PASSWORD,
#    database='DatabaseOfInterest')
conn = pymssql.connect(host="********", user="root",password="l******",database="final",charset="utf8mb4") 
# 得到一個可以執行SQL語句的光標對象
cursor = conn.cursor()
# 定義要執行的SQL語句
sql = "select * from efficiency_test" 

a= []
# 執行SQL語句
try:
    cursor.execute(sql)
    results = cursor.fetchall()    #獲取查詢的所有記錄
    
    #遍歷結果  
    for row in results :        
        temp = list(row)
        a.append(temp)
    
    df = pd.DataFrame(a,columns=['款號名稱','工序名稱','朱發利','楊小玲','黃金群','劉紅','吳則文','韓安貴','余章容','曾小嬌','廖文華','張世豔','陳維會','牟金玉','鄧俊英','高約珍','覃軍信','雷紅英','曾慶霞','郭梅','李秀英','王太容','陳文輝','杜大軍','陳開美','聶福潤','蔡鳳蓮','盧中良','代自利','朱學娥','代自容','謝吉香','何棚','程自友','劉冰瑤','李陽軍','鄭四瓊','周啟秀','黃代利','粟高富','胡紹容','康燕清','杜春','楊琴','張啟南','向春花','粟明翔','鐘傑','鐘德先','葉曉琴','龍良瓊','程孝芳','陳德碧','俞小琴','余春梅','彭聯華','歐常容','王陽芳','安明霞','王定偉','潘文花','潘文鳳','張愛國','效惠文','鄧霞','杜亞玲','李淑偉','鄒懷群','黃富英','劉祖彩','陳雙蓮','左志平','黃元玲','鐘俊澤','李美蘭','冉芬','張娟','晏慧蓮','周懷連','劉桃平','鄧勇','唐家惠','袁宗霞','陳宇','匡紅元','潘美玲','陳鳳娟','先方珍','徐自書','陳菊梅','張小敏','先大會','王滿妹','周喜紅','楊洪雲','龍丹','朱芬','陳志玉','王平友','胡木蘭','李轉玉','徐芳','塗東梅','胡體春','黎琴','郭平勇','彭蘭運','徐圓圓','藍珍靜','游萬瓊','于運英','曾得龍','吳學志','李小露','伍自英','李愛榮','胡定菊','徐開連','鐘群','冉茂芬','任榮梅','張金鳳','馮純山','李光蓮','郭家園','賀春秀','廖國香','李小儒','譚金運','萬丕中','李鳳珍','牟長兵','溫鳳華','黃結梅','于治國','牟偉','廖彩紅','王秋花','王華英','謝明菊','鄭雲祥','陳香英','鄭連幫','陳玲莉','王小萍','唐海瓊','樊安芳','賴世玉','張玉群','林倫桂','廖美榮','陳宗兵','張平','盧祥文','陳水英','朱岩山','後國鳳','王孝蓉','粟喜喜','陳冬香','袁慧嬋','薛創劍','李世俊','覃梅紅','賀秋英','彭文峰','李春秀','劉見洪','胡建仁','楊尚秀','陶菊華','屈志芳','梁香花','張家林','李三香','楊玉平','詹科','李淑珍','王飛','曾富霞','範流坪','譚茂月','標準工時'])
        
finally:   
# 關閉光標對象
    cursor.close()
# 關閉數據庫連接

    conn.close()


